import React from 'react';
import './About.css';

export default function About({children}) {
  
  return (
    <div className='block'>
      <div className='block__text'>
        <div className='nameText'>
          <h2>{children}</h2>
        </div>
        <span>Глобальна платформа Avon «ЗарадиНеї» покликана покращити життя 
          100 мільйонів жінок щороку. Avon розробила масштабний план дій, щоб 
          відкрити для жінок світ можливостей, свободи самовираження та самореалізації. 
          До 2030 року Avon на глобальному рівні працюватиме задля того, аби жінки світу 
          мали рівні можливості у веденні бізнесу за власними правилами, відчували себе 
          захищеними, були здоровими й звільнились від тиску стереотипів краси та 
          врешті обрали «красу за своїми правилами». </span>
          <span>До 2030 року Avon на глобальному рівні працюватиме 
            задля того, аби жінки світу мали рівні можливості у веденні бізнесу 
            за власними правилами, відчували себе захищеними, були здоровими 
            й звільнились від тиску стереотипів краси та врешті обрали 
            «красу за своїми правилами». </span>
      </div>
    </div>
  )
}